------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Dropbox\23_PSQF6270\PSQF6270_Example1\PSQF6270_Example1_STATA_Output.log
  log type:  text
 opened on:  18 Jan 2023, 16:42:31

.    
.    
. ///////////////////////////////////////////////////////////////////////////////////////
> ////////                     BEGIN DESCRIPTIVE STATISTICS                        //////
> ///////////////////////////////////////////////////////////////////////////////////////
>    
. display "STATA Descriptive Statistics"
STATA Descriptive Statistics

. format cognition age grip sexmw demnf demnc %4.3f      // to control precision

. summarize cognition age grip sexmw demnf demnc, format // for quantitative variables

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   cognition |        550      24.822      10.989      0.000     44.000
         age |        550      84.927       3.430     80.016     96.967
        grip |        550       9.113       2.983      0.000     19.000
       sexmw |        550       0.587       0.493      0.000      1.000
       demnf |        550       0.198       0.399      0.000      1.000
-------------+---------------------------------------------------------
       demnc |        550       0.076       0.266      0.000      1.000

. summarize cognition age grip sexmw demnf demnc, detail // detail to get variance

                cognition: Cognition Outcome
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            5              0
10%            9              0       Obs                 550
25%           17              0       Sum of Wgt.         550

50%           25                      Mean           24.82182
                        Largest       Std. Dev.      10.98903
75%           33             44
90%           39             44       Variance       120.7587
95%           43             44       Skewness      -.2596808
99%           44             44       Kurtosis       2.393018

                      age: Age in Years
-------------------------------------------------------------
      Percentiles      Smallest
 1%     80.19669       80.01649
 5%     80.68365       80.05562
10%     81.28847       80.06843       Obs                 550
25%     82.32119       80.11557       Sum of Wgt.         550

50%     84.32677                      Mean           84.92679
                        Largest       Std. Dev.      3.430029
75%     86.18991       94.57739
90%      91.1665       95.17522       Variance        11.7651
95%     92.43851       95.74792       Skewness       1.098307
99%     94.40046       96.96728       Kurtosis       3.731198

                grip: Grip Strength in Pounds
-------------------------------------------------------------
      Percentiles      Smallest
 1%            3              0
 5%            4              1
10%            5              1       Obs                 550
25%            7              1       Sum of Wgt.         550

50%            9                      Mean           9.112727
                        Largest       Std. Dev.      2.982954
75%           11             16
90%           13             17       Variance       8.898016
95%           14             17       Skewness      -.0070618
99%           16             19       Kurtosis        2.83558

                 sexmw: Sex (0=Men, 1=Women)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                 550
25%            0              0       Sum of Wgt.         550

50%            1                      Mean           .5872727
                        Largest       Std. Dev.      .4927727
75%            1              1
90%            1              1       Variance        .242825
95%            1              1       Skewness      -.3545333
99%            1              1       Kurtosis       1.125694

      demnf: Dementia Predictor for None=0 vs Future=1
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                 550
25%            0              0       Sum of Wgt.         550

50%            0                      Mean           .1981818
                        Largest       Std. Dev.      .3989928
75%            0              1
90%            1              1       Variance       .1591952
95%            1              1       Skewness       1.514278
99%            1              1       Kurtosis       3.293037

      demnc: Dementia Predictor for None=0 vs Current=1
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                 550
25%            0              0       Sum of Wgt.         550

50%            0                      Mean           .0763636
                        Largest       Std. Dev.      .2658208
75%            0              1
90%            0              1       Variance       .0706607
95%            1              1       Skewness       3.190285
99%            1              1       Kurtosis       11.17792

. tabulate sexmw demgroup                                // for categorical variables

sexmw: Sex |  demgroup: Dementia Group 1N 2F
   (0=Men, |                3C
  1=Women) |         1          2          3 |     Total
-----------+---------------------------------+----------
     0.000 |       168         40         19 |       227 
     1.000 |       231         69         23 |       323 
-----------+---------------------------------+----------
     Total |       399        109         42 |       550 


. 
. 
. ///////////////////////////////////////////////////////////////////////////////////////
> ////////                   BEGIN GLM WITH MAIN EFFECTS ONLY                      //////
> ///////////////////////////////////////////////////////////////////////////////////////
> 
. display "STATA Eq 2.8: Main-Effects-Only GLM Predicting Cognition"
STATA Eq 2.8: Main-Effects-Only GLM Predicting Cognition

. regress cognition c.age85 c.grip9 c.sexmw c.demnf c.demnc, level(95)

      Source |       SS           df       MS      Number of obs   =       550
-------------+----------------------------------   F(5, 544)       =     41.75
       Model |  18385.9793         5  3677.19586   Prob > F        =    0.0000
    Residual |  47910.5589       544  88.0708803   R-squared       =    0.2773
-------------+----------------------------------   Adj R-squared   =    0.2707
       Total |  66296.5382       549  120.758722   Root MSE        =    9.3846

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       age85 |   -.405734   .1188972    -3.41   0.001    -.6392878   -.1721802
       grip9 |   .6042256   .1497757     4.03   0.000      .310016    .8984351
       sexmw |  -3.657374   .8914326    -4.10   0.000    -5.408446   -1.906303
       demnf |  -5.721971   1.019078    -5.61   0.000    -7.723782    -3.72016
       demnc |  -16.47981   1.522754   -10.82   0.000    -19.47101   -13.48862
       _cons |   29.26433   .6985079    41.90   0.000     27.89222    30.63643
------------------------------------------------------------------------------

. // LINCOM creates a single linear combination of fixed effects
.    lincom c.demnf*-1 + c.demnc*1 // Mean Diff: Future vs. Current = B5-B4

 ( 1)  - demnf + demnc = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -10.75784   1.707957    -6.30   0.000    -14.11284   -7.402844
------------------------------------------------------------------------------

. // TEST lumps together fixed effects for joint tests -- indicate DFnum by ()  
.    test (c.age85=0)(c.grip9=0)(c.sexmw=0)(c.demnf=0)(c.demnc=0) // DFnum=5 F-test for Model R2   

 ( 1)  age85 = 0
 ( 2)  grip9 = 0
 ( 3)  sexmw = 0
 ( 4)  demnf = 0
 ( 5)  demnc = 0

       F(  5,   544) =   41.75
            Prob > F =    0.0000

.    test (c.demnf=0)(c.demnc=0)   // DFnum=2 Omnibus F-test for Demgroup   

 ( 1)  demnf = 0
 ( 2)  demnc = 0

       F(  2,   544) =   67.06
            Prob > F =    0.0000

. // Pred cognition outcomes holding sexmw=men, demnf=none, and demnc=none
. // predictor=(from(by)to), c.=quantitative predictor, vsquish compresses output empty lines
.    margins, at(c.age85=(-5(5)5) c.grip9=(-3(3)3) c.sexmw=0 c.demnf=0 c.demnc=0) vsquish

Adjusted predictions                            Number of obs     =        550
Model VCE    : OLS

Expression   : Linear prediction, predict()
1._at        : age85           =          -5
               grip9           =          -3
               sexmw           =           0
               demnf           =           0
               demnc           =           0
2._at        : age85           =          -5
               grip9           =           0
               sexmw           =           0
               demnf           =           0
               demnc           =           0
3._at        : age85           =          -5
               grip9           =           3
               sexmw           =           0
               demnf           =           0
               demnc           =           0
4._at        : age85           =           0
               grip9           =          -3
               sexmw           =           0
               demnf           =           0
               demnc           =           0
5._at        : age85           =           0
               grip9           =           0
               sexmw           =           0
               demnf           =           0
               demnc           =           0
6._at        : age85           =           0
               grip9           =           3
               sexmw           =           0
               demnf           =           0
               demnc           =           0
7._at        : age85           =           5
               grip9           =          -3
               sexmw           =           0
               demnf           =           0
               demnc           =           0
8._at        : age85           =           5
               grip9           =           0
               sexmw           =           0
               demnf           =           0
               demnc           =           0
9._at        : age85           =           5
               grip9           =           3
               sexmw           =           0
               demnf           =           0
               demnc           =           0

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   29.48032   1.155906    25.50   0.000     27.20973     31.7509
          2  |     31.293   .9209086    33.98   0.000     29.48402    33.10197
          3  |   33.10567   .8739657    37.88   0.000     31.38891    34.82243
          4  |   27.45165   .9373122    29.29   0.000     25.61045    29.29284
          5  |   29.26433   .6985079    41.90   0.000     27.89222    30.63643
          6  |     31.077   .7078574    43.90   0.000     29.68653    32.46747
          7  |   25.42298   1.061987    23.94   0.000     23.33688    27.50908
          8  |   27.23566    .913554    29.81   0.000     25.44113    29.03018
          9  |   29.04833   .9721806    29.88   0.000     27.13864    30.95802
------------------------------------------------------------------------------

.  // Get and save plot of predicted outcomes
.     marginsplot, xdimension(grip9) name(predicted_means, replace) 

  Variables that uniquely identify margins: age85 grip9

.       graph export "$filesave\STATA plots\STATA Main-Effect-Only GLM Plot.png", replace
(file C:\Dropbox\23_PSQF6270\PSQF6270_Example1\STATA plots\STATA Main-Effect-Only GLM Plot.png written in PNG format)

.    
.    
. ///////////////////////////////////////////////////////////////////////////////////////
> ////////                   BEGIN GLM WITH AGE*GRIP INTERACTION                   //////
> ///////////////////////////////////////////////////////////////////////////////////////
> 
. display "STATA Eq 2.9: GLM with Age by Grip Interaction"
STATA Eq 2.9: GLM with Age by Grip Interaction

. regress cognition c.age85 c.grip9 c.sexmw c.demnf c.demnc c.age85#c.grip9, level(95)

      Source |       SS           df       MS      Number of obs   =       550
-------------+----------------------------------   F(6, 543)       =     36.85
       Model |  19185.0411         6  3197.50684   Prob > F        =    0.0000
    Residual |  47111.4971       543  86.7615048   R-squared       =    0.2894
-------------+----------------------------------   Adj R-squared   =    0.2815
       Total |  66296.5382       549  120.758722   Root MSE        =    9.3146

---------------------------------------------------------------------------------
      cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
          age85 |  -.3339606   .1203566    -2.77   0.006    -.5703821   -.0975391
          grip9 |   .6194186   .1487424     4.16   0.000     .3272376    .9115996
          sexmw |  -3.455637   .8872749    -3.89   0.000    -5.198549   -1.712726
          demnf |  -5.922543   1.013632    -5.84   0.000    -7.913663   -3.931424
          demnc |   -16.3004   1.512547   -10.78   0.000    -19.27157   -13.32924
                |
c.age85#c.grip9 |   .1230185   .0405363     3.03   0.003     .0433914    .2026456
                |
          _cons |    29.4078   .6949062    42.32   0.000     28.04277    30.77284
---------------------------------------------------------------------------------

.   lincom c.demnf*-1 + c.demnc*1 // Mean Diff: Future vs. Current = Beta5-Beta4

 ( 1)  - demnf + demnc = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -10.37786   1.699831    -6.11   0.000    -13.71691   -7.038812
------------------------------------------------------------------------------

.   test (c.demnf=0)(c.demnc=0)   // DFnum=2 Omnibus F-test for main effect of demgroup

 ( 1)  demnf = 0
 ( 2)  demnc = 0

       F(  2,   543) =   67.70
            Prob > F =    0.0000

.   test (c.age85=0)(c.grip9=0)(c.age85#c.grip9=0) // DFnum=3 F-test for age, grip, age*grip

 ( 1)  age85 = 0
 ( 2)  grip9 = 0
 ( 3)  c.age85#c.grip9 = 0

       F(  3,   543) =   14.60
            Prob > F =    0.0000

. // Simple slopes for age per grip, grip per age
.    lincom c.age85*1 + c.age85#c.grip9*-3  // Age Slope at Grip =  6

 ( 1)  age85 - 3*c.age85#c.grip9 = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   -.703016   .1533696    -4.58   0.000    -1.004286   -.4017456
------------------------------------------------------------------------------

.    lincom c.age85*1 + c.age85#c.grip9*0   // Age Slope at Grip =  9

 ( 1)  age85 = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.3339606   .1203566    -2.77   0.006    -.5703821   -.0975391
------------------------------------------------------------------------------

.    lincom c.age85*1 + c.age85#c.grip9*3   // Age Slope at Grip = 12

 ( 1)  age85 + 3*c.age85#c.grip9 = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0350949   .1871539     0.19   0.851    -.3325394    .4027291
------------------------------------------------------------------------------

.    lincom c.grip9*1 + c.age85#c.grip9*-5  // Grip Slope at Age = 80

 ( 1)  grip9 - 5*c.age85#c.grip9 = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0043262   .2473351     0.02   0.986    -.4815246     .490177
------------------------------------------------------------------------------

.    lincom c.grip9*1 + c.age85#c.grip9*0   // Grip Slope at Age = 85

 ( 1)  grip9 = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6194186   .1487424     4.16   0.000     .3272376    .9115996
------------------------------------------------------------------------------

.    lincom c.grip9*1 + c.age85#c.grip9*5   // Grip Slope at Age = 90

 ( 1)  grip9 + 5*c.age85#c.grip9 = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.234511   .2554083     4.83   0.000     .7328017     1.73622
------------------------------------------------------------------------------

. // dydx in margins provides simple slopes for that variable by (from(by)to) moderator
.    margins, at(c.grip9=(-3(3)3)) dydx(c.age85) vsquish // Age Slope per Grip

Average marginal effects                        Number of obs     =        550
Model VCE    : OLS

Expression   : Linear prediction, predict()
dy/dx w.r.t. : age85
1._at        : grip9           =          -3
2._at        : grip9           =           0
3._at        : grip9           =           3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
age85        |
         _at |
          1  |   -.703016   .1533696    -4.58   0.000    -1.004286   -.4017456
          2  |  -.3339606   .1203566    -2.77   0.006    -.5703821   -.0975391
          3  |   .0350949   .1871539     0.19   0.851    -.3325394    .4027291
------------------------------------------------------------------------------

.    margins, at(c.age85=(-5(5)5)) dydx(c.grip9) vsquish // Grip Slope per Age

Average marginal effects                        Number of obs     =        550
Model VCE    : OLS

Expression   : Linear prediction, predict()
dy/dx w.r.t. : grip9
1._at        : age85           =          -5
2._at        : age85           =           0
3._at        : age85           =           5

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
grip9        |
         _at |
          1  |   .0043262   .2473351     0.02   0.986    -.4815246     .490177
          2  |   .6194186   .1487424     4.16   0.000     .3272376    .9115996
          3  |   1.234511   .2554083     4.83   0.000     .7328017     1.73622
------------------------------------------------------------------------------

. // predictor=(from(by)to), c.=quantitative predictor, vsquish compresses output empty lines 
.    margins, at(c.age85=(-5(5)5) c.grip9=(-3(3)3) c.sexmw=0 c.demnf=0 c.demnc=0) vsquish

Adjusted predictions                            Number of obs     =        550
Model VCE    : OLS

Expression   : Linear prediction, predict()
1._at        : age85           =          -5
               grip9           =          -3
               sexmw           =           0
               demnf           =           0
               demnc           =           0
2._at        : age85           =          -5
               grip9           =           0
               sexmw           =           0
               demnf           =           0
               demnc           =           0
3._at        : age85           =          -5
               grip9           =           3
               sexmw           =           0
               demnf           =           0
               demnc           =           0
4._at        : age85           =           0
               grip9           =          -3
               sexmw           =           0
               demnf           =           0
               demnc           =           0
5._at        : age85           =           0
               grip9           =           0
               sexmw           =           0
               demnf           =           0
               demnc           =           0
6._at        : age85           =           0
               grip9           =           3
               sexmw           =           0
               demnf           =           0
               demnc           =           0
7._at        : age85           =           5
               grip9           =          -3
               sexmw           =           0
               demnf           =           0
               demnc           =           0
8._at        : age85           =           5
               grip9           =           0
               sexmw           =           0
               demnf           =           0
               demnc           =           0
9._at        : age85           =           5
               grip9           =           3
               sexmw           =           0
               demnf           =           0
               demnc           =           0

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   31.06463   1.260473    24.65   0.000     28.58863    33.54063
          2  |   31.07761   .9167886    33.90   0.000     29.27672    32.87849
          3  |   31.09058   1.092408    28.46   0.000     28.94472    33.23645
          4  |   27.54955   .9308775    29.60   0.000     25.72099    29.37811
          5  |    29.4078   .6949062    42.32   0.000     28.04277    30.77284
          6  |   31.26606   .7053323    44.33   0.000     29.88054    32.65157
          7  |   24.03447    1.14908    20.92   0.000     21.77728    26.29165
          8  |     27.738   .9217228    30.09   0.000     25.92742    29.54858
          9  |   31.44153   1.246179    25.23   0.000     28.99361    33.88945
------------------------------------------------------------------------------

.    marginsplot, xdimension(age85)   // Get and save plot for pred outcomes by age 

  Variables that uniquely identify margins: age85 grip9

.    graph export "$filesave\STATA plots\STATA Grip by Age=x GLM Plot.png", replace
(file C:\Dropbox\23_PSQF6270\PSQF6270_Example1\STATA plots\STATA Grip by Age=x GLM Plot.png written in PNG format)

.    marginsplot, xdimension(grip9)   // Get and save plot for pred outcomes by grip 

  Variables that uniquely identify margins: age85 grip9

.    graph export "$filesave\STATA plots\STATA Age by Grip=x GLM Plot.png", replace
(file C:\Dropbox\23_PSQF6270\PSQF6270_Example1\STATA plots\STATA Age by Grip=x GLM Plot.png written in PNG format)

.    
. display "STATA Eq 2.9: GLM with Age by Grip Interaction adding VCE for Regions"
STATA Eq 2.9: GLM with Age by Grip Interaction adding VCE for Regions

. regress cognition c.age85 c.grip9 c.sexmw c.demnf c.demnc c.age85#c.grip9, level(95)

      Source |       SS           df       MS      Number of obs   =       550
-------------+----------------------------------   F(6, 543)       =     36.85
       Model |  19185.0411         6  3197.50684   Prob > F        =    0.0000
    Residual |  47111.4971       543  86.7615048   R-squared       =    0.2894
-------------+----------------------------------   Adj R-squared   =    0.2815
       Total |  66296.5382       549  120.758722   Root MSE        =    9.3146

---------------------------------------------------------------------------------
      cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
          age85 |  -.3339606   .1203566    -2.77   0.006    -.5703821   -.0975391
          grip9 |   .6194186   .1487424     4.16   0.000     .3272376    .9115996
          sexmw |  -3.455637   .8872749    -3.89   0.000    -5.198549   -1.712726
          demnf |  -5.922543   1.013632    -5.84   0.000    -7.913663   -3.931424
          demnc |   -16.3004   1.512547   -10.78   0.000    -19.27157   -13.32924
                |
c.age85#c.grip9 |   .1230185   .0405363     3.03   0.003     .0433914    .2026456
                |
          _cons |    29.4078   .6949062    42.32   0.000     28.04277    30.77284
---------------------------------------------------------------------------------

.   estat vce  // Asymptotic covariance matrix of fixed effects for regions

Covariance matrix of coefficients of regress model

             |                                                                c.age85#            
        e(V) |      age85       grip9       sexmw       demnf       demnc     c.grip9       _cons 
-------------+------------------------------------------------------------------------------------
       age85 |   .0144857                                                                         
       grip9 |  .00331698    .0221243                                                             
       sexmw |    .005024   .05374269   .78725672                                                 
       demnf | -.00413095  -.01338766  -.07101552    1.027449                                     
       demnc | -.00115115  -.00030106   .02370811   .21291169   2.2877993                         
     c.age85#|                                                                                    
     c.grip9 |   .0009587   .00020294   .00269465  -.00267909    .0023964   .00164319             
       _cons |  .00045357  -.03075328  -.45067156  -.18202858  -.22634698   .00191647   .48289456 

. 
.   
. ///////////////////////////////////////////////////////////////////////////////////////
> ////////                   BEGIN GLM WITH SEX*DEMGROUP INTERACTION               //////
> ///////////////////////////////////////////////////////////////////////////////////////   
> 
. display "STATA Eq 2.13: Adding Sex by Dementia Group Interaction"
STATA Eq 2.13: Adding Sex by Dementia Group Interaction

. display "Dummy-Coded Predictors for Sex (0=Men) and Demgroup (0=None)"
Dummy-Coded Predictors for Sex (0=Men) and Demgroup (0=None)

. regress cognition c.age85 c.grip9 c.sexmw c.demnf c.demnc c.age85#c.grip9  ///
>                   c.sexmw#c.demnf c.sexmw#c.demnc, level(95)

      Source |       SS           df       MS      Number of obs   =       550
-------------+----------------------------------   F(8, 541)       =     28.77
       Model |  19785.4615         8  2473.18268   Prob > F        =    0.0000
    Residual |  46511.0767       541  85.9724154   R-squared       =    0.2984
-------------+----------------------------------   Adj R-squared   =    0.2881
       Total |  66296.5382       549  120.758722   Root MSE        =    9.2721

---------------------------------------------------------------------------------
      cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
          age85 |  -.3347988   .1198875    -2.79   0.005    -.5703009   -.0992966
          grip9 |   .6178929   .1480794     4.17   0.000     .3270117     .908774
          sexmw |  -2.875594   1.011237    -2.84   0.005    -4.862027   -.8891616
          demnf |  -6.055901   1.635126    -3.70   0.000    -9.267875   -2.843927
          demnc |  -11.97073   2.244954    -5.33   0.000    -16.38062   -7.560836
                |
c.age85#c.grip9 |   .1221516   .0403529     3.03   0.003     .0428841    .2014191
                |
c.sexmw#c.demnf |     .16427   2.070475     0.08   0.937    -3.902886    4.231426
                |
c.sexmw#c.demnc |    -7.8751   3.024536    -2.60   0.009    -13.81637   -1.933825
                |
          _cons |   29.07015   .7484992    38.84   0.000     27.59983    30.54047
---------------------------------------------------------------------------------

. // Omnibus DF=2 F-Test for Dementia*Sex Interaction              
.    test (c.sexmw#c.demnf=0) (c.sexmw#c.demnc=0) 

 ( 1)  c.sexmw#c.demnf = 0
 ( 2)  c.sexmw#c.demnc = 0

       F(  2,   541) =    3.49
            Prob > F =    0.0311

. // In TESTs below, linear combinations are created within parentheses (still 1 DF each)
.    // Omnibus DF=2 F-test for Dementia Simple Main Effect for Men
.       test (c.demnf*1 + c.sexmw#c.demnf*0 =0)(c.demnc*1 + c.sexmw#c.demnc*0=0)                    

 ( 1)  demnf = 0
 ( 2)  demnc = 0

       F(  2,   541) =   18.69
            Prob > F =    0.0000

.    // Omnibus DF=2 F-test for Dementia Simple Main Effect for Men
.       test (c.demnf*1 + c.sexmw#c.demnf*1 =0)(c.demnc*1 + c.sexmw#c.demnc*1=0)  

 ( 1)  demnf + c.sexmw#c.demnf = 0
 ( 2)  demnc + c.sexmw#c.demnc = 0

       F(  2,   541) =   53.16
            Prob > F =    0.0000

. // Predicted cognition outcomes --adjusted cell means-- holding age=85 and grip=9
.    margins, at(c.age85=0 c.grip9=0 c.sexmw=(0(1)1) c.demnf=0 c.demnc=0) // yhats for None

Adjusted predictions                            Number of obs     =        550
Model VCE    : OLS

Expression   : Linear prediction, predict()

1._at        : age85           =           0
               grip9           =           0
               sexmw           =           0
               demnf           =           0
               demnc           =           0

2._at        : age85           =           0
               grip9           =           0
               sexmw           =           1
               demnf           =           0
               demnc           =           0

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   29.07015   .7484992    38.84   0.000     27.59983    30.54047
          2  |   26.19455    .638834    41.00   0.000     24.93965    27.44945
------------------------------------------------------------------------------

.    margins, at(c.age85=0 c.grip9=0 c.sexmw=(0(1)1) c.demnf=1 c.demnc=0) // yhats for Future

Adjusted predictions                            Number of obs     =        550
Model VCE    : OLS

Expression   : Linear prediction, predict()

1._at        : age85           =           0
               grip9           =           0
               sexmw           =           0
               demnf           =           1
               demnc           =           0

2._at        : age85           =           0
               grip9           =           0
               sexmw           =           1
               demnf           =           1
               demnc           =           0

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   23.01424    1.49276    15.42   0.000     20.08193    25.94656
          2  |   20.30292   1.118633    18.15   0.000     18.10552    22.50032
------------------------------------------------------------------------------

.    margins, at(c.age85=0 c.grip9=0 c.sexmw=(0(1)1) c.demnf=0 c.demnc=1) // yhats for Current

Adjusted predictions                            Number of obs     =        550
Model VCE    : OLS

Expression   : Linear prediction, predict()

1._at        : age85           =           0
               grip9           =           0
               sexmw           =           0
               demnf           =           0
               demnc           =           1

2._at        : age85           =           0
               grip9           =           0
               sexmw           =           1
               demnf           =           0
               demnc           =           1

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   17.09942   2.140218     7.99   0.000     12.89526    21.30357
          2  |   6.348722    1.94788     3.26   0.001     2.522386    10.17506
------------------------------------------------------------------------------

. // DF=1 simple slopes for sex per demgroup
.    lincom c.sexmw*1 + c.sexmw#c.demnf*0 + c.sexmw#demnc*0  // Sex Diff for No Dementia

 ( 1)  sexmw = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -2.875594   1.011237    -2.84   0.005    -4.862027   -.8891616
------------------------------------------------------------------------------

.    lincom c.sexmw*1 + c.sexmw#c.demnf*1 + c.sexmw#demnc*0  // Sex Diff for Future Dementia

 ( 1)  sexmw + c.sexmw#c.demnf = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -2.711324   1.874069    -1.45   0.149    -6.392667    .9700192
------------------------------------------------------------------------------

.    lincom c.sexmw*1 + c.sexmw#c.demnf*0 + c.sexmw#demnc*1  // Sex Diff for Current Dementia

 ( 1)  sexmw + c.sexmw#c.demnc = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -10.75069   2.899323    -3.71   0.000      -16.446   -5.055383
------------------------------------------------------------------------------

. // DF=1 simple slopes for demgroup per sex
.    lincom c.demnf*1  + c.demnc*0 + c.sexmw#c.demnf*0  + c.sexmw#c.demnc*0 // None-Future Diff for Men

 ( 1)  demnf = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -6.055901   1.635126    -3.70   0.000    -9.267875   -2.843927
------------------------------------------------------------------------------

.    lincom c.demnf*1  + c.demnc*0 + c.sexmw#c.demnf*1  + c.sexmw#c.demnc*0 // None-Future Diff for Women

 ( 1)  demnf + c.sexmw#c.demnf = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -5.891631   1.277761    -4.61   0.000    -8.401612   -3.381651
------------------------------------------------------------------------------

.    lincom c.demnf*0  + c.demnc*1 + c.sexmw#c.demnf*0  + c.sexmw#c.demnc*0 // None-Current Diff for Men

 ( 1)  demnc = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -11.97073   2.244954    -5.33   0.000    -16.38062   -7.560836
------------------------------------------------------------------------------

.    lincom c.demnf*0  + c.demnc*1 + c.sexmw#c.demnf*0  + c.sexmw#c.demnc*1 // None-Current Diff for Women 

 ( 1)  demnc + c.sexmw#c.demnc = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -19.84583   2.028583    -9.78   0.000    -23.83069   -15.86097
------------------------------------------------------------------------------

.    lincom c.demnf*-1 + c.demnc*1 + c.sexmw#c.demnf*0  + c.sexmw#c.demnc*0 // Future-Current Diff for Men

 ( 1)  - demnf + demnc = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -5.914829   2.586762    -2.29   0.023    -10.99616      -.8335
------------------------------------------------------------------------------

.    lincom c.demnf*-1 + c.demnc*1 + c.sexmw#c.demnf*-1 + c.sexmw#c.demnc*1 // Future-Current Diff for Women

 ( 1)  - demnf + demnc - c.sexmw#c.demnf + c.sexmw#c.demnc = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   -13.9542   2.238917    -6.23   0.000    -18.35223   -9.556162
------------------------------------------------------------------------------

. // DF=1 differences in simple slopes = interactions
.    lincom c.sexmw#c.demnf*1  + c.sexmw#c.demnc*0  // A: Sex Effect differ btw None and Future?

 ( 1)  c.sexmw#c.demnf = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |     .16427   2.070475     0.08   0.937    -3.902886    4.231426
------------------------------------------------------------------------------

.    lincom c.sexmw#c.demnf*1  + c.sexmw#c.demnc*0  // A: None-Future Effect differ btw Men and Women?

 ( 1)  c.sexmw#c.demnf = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |     .16427   2.070475     0.08   0.937    -3.902886    4.231426
------------------------------------------------------------------------------

.    lincom c.sexmw#c.demnf*0  + c.sexmw#c.demnc*1  // B: Sex Effect differ btw None and Current?

 ( 1)  c.sexmw#c.demnc = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    -7.8751   3.024536    -2.60   0.009    -13.81637   -1.933825
------------------------------------------------------------------------------

.    lincom c.sexmw#c.demnf*0  + c.sexmw#c.demnc*1  // B: None-Current Effect differ btw Men and Women?

 ( 1)  c.sexmw#c.demnc = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    -7.8751   3.024536    -2.60   0.009    -13.81637   -1.933825
------------------------------------------------------------------------------

.    lincom c.sexmw#c.demnf*-1 + c.sexmw#c.demnc*1  // C: Sex Effect differ btw Future and Current?

 ( 1)  - c.sexmw#c.demnf + c.sexmw#c.demnc = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   -8.03937   3.415165    -2.35   0.019    -14.74798   -1.330761
------------------------------------------------------------------------------

.    lincom c.sexmw#c.demnf*-1 + c.sexmw#c.demnc*1  // C: Future-Current Effect differ btw Men and Women?

 ( 1)  - c.sexmw#c.demnf + c.sexmw#c.demnc = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   -8.03937   3.415165    -2.35   0.019    -14.74798   -1.330761
------------------------------------------------------------------------------

.    
. // To make pictures, need to represent demgroup as program-categorical predictor instead 
. display "STATA Eq 2.13: Adding Sex by Dementia Group Interaction"
STATA Eq 2.13: Adding Sex by Dementia Group Interaction

. display "Program-Categorical Predictor for Demgroup Instead"
Program-Categorical Predictor for Demgroup Instead

. regress cognition c.age85 c.grip9 c.sexmw i.demgroup c.age85#c.grip9 c.sexmw#i.demgroup, level(95)

      Source |       SS           df       MS      Number of obs   =       550
-------------+----------------------------------   F(8, 541)       =     28.77
       Model |  19785.4615         8  2473.18268   Prob > F        =    0.0000
    Residual |  46511.0767       541  85.9724154   R-squared       =    0.2984
-------------+----------------------------------   Adj R-squared   =    0.2881
       Total |  66296.5382       549  120.758722   Root MSE        =    9.2721

----------------------------------------------------------------------------------
       cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           age85 |  -.3347988   .1198875    -2.79   0.005    -.5703009   -.0992966
           grip9 |   .6178929   .1480794     4.17   0.000     .3270117     .908774
           sexmw |  -2.875594   1.011237    -2.84   0.005    -4.862027   -.8891616
                 |
        demgroup |
              2  |  -6.055901   1.635126    -3.70   0.000    -9.267875   -2.843927
              3  |  -11.97073   2.244954    -5.33   0.000    -16.38062   -7.560836
                 |
 c.age85#c.grip9 |   .1221516   .0403529     3.03   0.003     .0428841    .2014191
                 |
demgroup#c.sexmw |
              2  |     .16427   2.070475     0.08   0.937    -3.902886    4.231426
              3  |    -7.8751   3.024536    -2.60   0.009    -13.81637   -1.933825
                 |
           _cons |   29.07015   .7484992    38.84   0.000     27.59983    30.54047
----------------------------------------------------------------------------------

. // Get predicted cognition outcomes --adjusted cell means-- holding age=85 and grip=9
.    margins i.demgroup, at(c.age85=0 c.grip9=0 c.sexmw=(0(1)1))   

Adjusted predictions                            Number of obs     =        550
Model VCE    : OLS

Expression   : Linear prediction, predict()

1._at        : age85           =           0
               grip9           =           0
               sexmw           =           0

2._at        : age85           =           0
               grip9           =           0
               sexmw           =           1

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
_at#demgroup |
        1 1  |   29.07015   .7484992    38.84   0.000     27.59983    30.54047
        1 2  |   23.01424    1.49276    15.42   0.000     20.08193    25.94656
        1 3  |   17.09942   2.140218     7.99   0.000     12.89526    21.30357
        2 1  |   26.19455    .638834    41.00   0.000     24.93965    27.44945
        2 2  |   20.30292   1.118633    18.15   0.000     18.10552    22.50032
        2 3  |   6.348722    1.94788     3.26   0.001     2.522386    10.17506
------------------------------------------------------------------------------

.    marginsplot, xdimension(demgroup)  // Get and save plot for pred outcomes by demgroup 

  Variables that uniquely identify margins: sexmw demgroup

.    graph export "$filesave\STATA plots\STATA Sex by Demgroup=x GLM Plot.png", replace
(file C:\Dropbox\23_PSQF6270\PSQF6270_Example1\STATA plots\STATA Sex by Demgroup=x GLM Plot.png written in PNG format)

.    marginsplot, xdimension(sexmw)  // Get and save plot for pred outcomes by sexmw 

  Variables that uniquely identify margins: sexmw demgroup

.    graph export "$filesave\STATA plots\STATA Demgroup by Sex=x GLM Plot.png", replace
(file C:\Dropbox\23_PSQF6270\PSQF6270_Example1\STATA plots\STATA Demgroup by Sex=x GLM Plot.png written in PNG format)

. 
. // Close log
. log close
      name:  <unnamed>
       log:  C:\Dropbox\23_PSQF6270\PSQF6270_Example1\PSQF6270_Example1_STATA_Output.log
  log type:  text
 closed on:  18 Jan 2023, 16:42:40
------------------------------------------------------------------------------------------------------------------------------------------------------
